# Библиотека Pandas

In [1]:
# импорт библиотеки и создание 1 pandas датафрейма
# датафрейм будет хранить и отображать табличные данные для нас

import pandas as pd
import numpy as np
df = pd.DataFrame()

In [2]:
type(df)

pandas.core.frame.DataFrame

In [3]:
# df - название датафрейма
# ['name'] - название колонки
# [n, n, n] - структура словаря и таблицы

df['STATS'] = [9, 10, 7]

In [4]:
# добавить колонку
df['PROG'] = [8, 5, 10]

In [5]:
df

   STATS  PROG
0      9     8
1     10     5
2      7    10

In [6]:
display(df)

   STATS  PROG
0      9     8
1     10     5
2      7    10

In [7]:
# обращение к колонке таблицы
df['STATS']

0     9
1    10
2     7
Name: STATS, dtype: int64

In [8]:
# .name - атрибут, выводит имя колонки
df['STATS'].name

'STATS'

In [9]:
# .dtype - атрибут, выводит тип данных, содержащихся в колонке
df['STATS'].dtype

dtype('int64')

In [10]:
# .values - атрибут, выводит NumPy массив
df['STATS'].values

array([ 9, 10,  7])

In [11]:
# dataframe, где 1 коллонка типа pandas, а внутри - массив NumPy

In [12]:
type(df['STATS'].values)

numpy.ndarray

In [13]:
type(df['STATS'])

pandas.core.series.Series

In [14]:
df['AVERAGE'] = (df['STATS'] + df['PROG']) / 2
df['AVARAGE'] = (df['STATS'] + df['PROG']) / 10
df

   STATS  PROG  AVERAGE  AVARAGE
0      9     8      8.5      1.7
1     10     5      7.5      1.5
2      7    10      8.5      1.7

In [15]:
df['PROG']

0     8
1     5
2    10
Name: PROG, dtype: int64

In [16]:
df[['STATS', 'AVERAGE']]

   STATS  AVERAGE
0      9      8.5
1     10      7.5
2      7      8.5

In [17]:
df = df[['AVERAGE', 'STATS', 'PROG']]

In [18]:
df

   AVERAGE  STATS  PROG
0      8.5      9     8
1      7.5     10     5
2      8.5      7    10

In [19]:
# .columns - атрибут, выводит объект со всеми колонками
df.columns

Index(['AVERAGE', 'STATS', 'PROG'], dtype='object')

In [20]:
# замена названия колонок
df.columns = ['AV', 'STATS', 'PROG']
df

    AV  STATS  PROG
0  8.5      9     8
1  7.5     10     5
2  8.5      7    10

In [21]:
# .index - атрибут, выводит индексацию
df.index

RangeIndex(start=0, stop=3, step=1)

In [22]:
# замена объекта в индексе
df.index = ['A', 'M', 'P']
df

    AV  STATS  PROG
A  8.5      9     8
M  7.5     10     5
P  8.5      7    10

In [23]:
# достаем ряд из таблицы
df.iloc[0] # порядковый номер ряда

AV       8.5
STATS    9.0
PROG     8.0
Name: A, dtype: float64

In [24]:
df.loc['A'] # ряд по названию

AV       8.5
STATS    9.0
PROG     8.0
Name: A, dtype: float64

In [25]:
df.index = ['Alice', 'Mark', 'Petya']

In [26]:
df

        AV  STATS  PROG
Alice  8.5      9     8
Mark   7.5     10     5
Petya  8.5      7    10

In [27]:
df.iloc[0, 0] # обращаемся через индекс

np.float64(8.5)

In [28]:
df.loc['Alice', 'STATS'] # обращаемся через названия

np.int64(9)

In [29]:
df['STATS'][0] # через колонку

/var/folders/r9/cvmqk7fd3812mp7_snc8tfzc0000gn/T/ipykernel_97153/1766749748.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df['STATS'][0] # через колонку

np.int64(9)

In [30]:
df.iloc[0]

AV       8.5
STATS    9.0
PROG     8.0
Name: Alice, dtype: float64

In [31]:
pd.DataFrame({'a':[2,4], 'b':[4,5]})

   a  b
0  2  4
1  4  5

Чтение существующих таблиц и данных

In [37]:
df_csv_1 = pd.read_csv('students.csv')
df_csv_1

           Имя Фамилия                 EMAIL  КР  ИТОГ
0          Иван Иванов         ivanov@hse.ru   5     6
1          Петр Петров         petrov@hse.ru   8    10
2      Мария Кузнецова     kuznetsova@hse.ru   7     8
3     Татьяна Смирнова       smirnova@hse.ru   3     9
4       Камиль Ахметов       akhmetov@hse.ru   8     6
5         Софья Сонина         sonina@hse.ru  10    10
6       Андрей Андреев        andreev@hse.ru   2     4
7   Алина Хисматуллина  khismatullina@hse.ru   3     3
8        Семен Семенов        semenov@hse.ru   5     8
9        Макар Макаров        makarov@hse.ru   9     6
10  Василиса Васильева      vasilieva@hse.ru   5     7
11      Корней Корнеев        korneev@hse.ru   4     1
12    Тимофей Тимофеев       timofeev@hse.ru   8     9
13    Екатерина Катина         katina@hse.ru   5     4
14        Елена Ленина         lenina@hse.ru   6     6

In [38]:
df_csv_2 = pd.read_csv('coffee_stats_2.csv', sep = ';', header = None, 
                       names = ['Type', 'Size', 'Sirop'] )
df_csv_2

         Type       Size        Sirop
0         раф    большой   шоколадный
1    капучино    большой    ванильный
2         раф  маленький      розовый
3         раф    большой  карамельный
4       латте  маленький          NaN
..        ...        ...          ...
144     латте    большой  карамельный
145  капучино    большой     кленовый
146       раф    большой   шоколадный
147       раф    средний  карамельный
148  капучино  маленький          NaN

[149 rows x 3 columns]

In [39]:
df_txt = pd.read_csv('forest.txt', sep = '\t')
df_txt

    year     hare     lynx  carrot
0   1900  30000.0   4000.0   48300
1   1901  47200.0   6100.0   48200
2   1902  70200.0   9800.0   41500
3   1903  77400.0  35200.0   38200
4   1904  36300.0  59400.0   40600
5   1905  20600.0  41700.0   39800
6   1906  18100.0  19000.0   38600
7   1907  21400.0  13000.0   42300
8   1908  22000.0   8300.0   44500
9   1909  25400.0   9100.0   42100
10  1910  27100.0   7400.0   46000
11  1911  40300.0   8000.0   46800
12  1912  57000.0  12300.0   43800
13  1913  76600.0  19500.0   40900
14  1914  52300.0  45700.0   39400
15  1915  19500.0  51100.0   39000
16  1916  11200.0  29700.0   36700
17  1917   7600.0  15800.0   41800
18  1918  14600.0   9700.0   43300
19  1919  16200.0  10100.0   41300
20  1920  24700.0   8600.0   47300

In [40]:
rating = np.array([3.4, 2.9, 0.2, 8.3, 9.2, 3.4, 4.2])
print(rating[(rating < 1.6) | (rating >  3.5)])

[0.2 8.3 9.2 4.2]